package pre;

import java.util.HashSet;
import java.util.Iterator;
import java.util.Set;

public class pre{
	public static void main(String[] args) {
		String s = "qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM0123456789零一二三四五六七八九十甲乙丙丁戊己庚辛壬癸子丑寅卯辰巳午未申酉戌亥刀枪剑戟斧钺钩叉鞭锏锤戈镋棍槊棒矛耙魁罡机闲勇雄猛威英贵富满孤伤立捷暗佑空速异杀微究退寿平罪损败牢慧暴哭巧斡旋造化颠倒阴阳移星换斗回天返日唤雨呼风振山撼地驾雾腾云划江成陆行大遁逆知来导出元降龙伏虎正琵琶浔阳江头夜送客枫叶荻花秋瑟瑟主人下马客在船举酒欲饮无管弦醉不成欢惨将别别时茫茫江浸月忽闻水上琵琶声主人忘归客不发寻声暗问弹者谁琵琶声停欲语迟移船相近邀相见添酒回灯重开宴千呼万唤始出来犹抱琵琶半遮面转轴拨弦三两声未成曲调先有情弦弦掩抑声声思似诉平生不得志低眉信手续续弹说尽心中无限事轻拢慢捻抹复挑初为霓裳后六幺大弦嘈嘈如急雨小弦切切如私语嘈嘈切切错杂弹大珠小珠落玉盘间关莺语花底滑幽咽泉流冰下难冰泉冷涩弦凝绝凝绝不通声暂歇别有幽愁暗恨生此时无声胜有声银瓶乍破水浆迸铁骑突出刀枪鸣曲终收拨当心画四弦一声如裂帛东船西舫悄无言唯见江心秋月白沉吟放拨插弦中整顿衣裳起敛容自言本是京城女家在虾蟆陵下住十三学得琵琶成名属教坊第一部曲罢曾教善才服妆成每被秋娘妒五陵年少争缠头一曲红绡不知数钿头银篦击节碎血色罗裙翻酒污今年欢笑复明年秋月春风等闲度弟走从军阿姨死暮去朝来颜色故门前冷落鞍马稀老大嫁作商人妇商人重利轻别离前月浮梁买茶去去来江口守空船绕船月明江水寒夜深忽梦少年事梦啼妆泪红阑干我闻琵琶已叹息又闻此语重唧唧同是天涯沦落人相逢何必曾相识我从去年辞帝京谪居卧病浔阳城浔阳地僻无音乐终岁不闻丝竹声住近湓江地低湿黄芦苦竹绕宅生其间旦暮闻何物杜鹃啼血猿哀鸣春江花朝秋月夜往往取酒还独倾岂无山歌与村笛呕哑嘲哳难为听今夜闻君琵琶语如听仙乐耳暂明莫辞更坐弹一曲为君作琵琶感我此言良久立却坐促弦弦转急凄凄不似向前声满座重闻皆掩泣座中泣下谁最多江州司马青衫湿";
		Set<Character> set = new HashSet<>();
		for(int i = 0;i<s.length();i++){
			set.add(s.charAt(i));
		}
		System.out.println(set.size());
		String s1 = "";
		Iterator<Character> it = set.iterator();
		while(it.hasNext())
			s1 = s1 + it.next();
		System.out.println(s1);
		System.out.println(s1.length());
		String s11 = "退送谁老调者逆将同名后小少向倒耙通君思速吟造逢急谪听0123耳4水破5琵6琶789尽落倾血A遁BCDE居FGHIJKL行MNOPQRSTU呕VWXYZ停属江瑟a污bc衣defgh恨ijk衫lmn遮o灯息pq山rstuvwxyz呼顿邀梁岁岂悄沉碎颜颠梦沦钩被钺撼咽钿哀铁裂情泉棍风哑棒裙胜泣惨部泪壬哭声裳哳银瓶僻愁复锏错多夜生感锤唤败大唧天唯甲申头贵收画放流元故浆商先酉镋酒浔教敛慢慧八六饮浮数走关女整其起浸啼腾西如善妆妇醉妒斗军斡斧涩涯冰冷离见私凄病槊旋秋始重凝州无日旦巧姨门自问己深闲已巳间时出移闻添击一刀言稀丁威七万切戈嘈三戊上下戌不明与成丑阑我划娘丙帛东初帝丝戟星鸣两春利别舫中是嘲阳阴船为主举阿鹃久陆手降乍才前虎限乐剑湓乙九牢物马良买色干平年陵究癸空幺幽白驾虾湿突暂节皆争事二云抑骑五底暗庚红亥度芦座京暮花抱暴犹抹人难嫁雄黄勇终今立从滑绕盘仙四绝回满绡拢苦雨拨独续英曲更零相竹雾曾开最异月有眉服伏挑笑霓化猛笛朝弟缠欢伤弦在未茫本第振地欲茶弹机似猿杀十魁杂千歇午等半坊歌低住子坐佑村归青当何罗作杜损罡换面罢正孤此来学卧罪转卯轴却捷荻轻捻死往宅守玉鞍得龙辛辞管客掩枪枫莫鞭微辰宴家容莺去心促寅必蟆识又叉诉富城每发近插寒返取志忘还矛迟珠信口知篦语音说叶迸司叹寻翻导忽寿";
		
		String s2 = "qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM0123456789零一二三四五六七八九十甲乙丙丁戊己庚辛壬癸子丑寅卯辰巳午未申酉戌亥刀枪剑戟斧钺钩叉鞭锏锤戈镋棍槊棒矛耙魁罡机闲勇雄猛威英";
		Set<Character> set1 = new HashSet<>();
		for(int i = 0;i<s2.length();i++){
			set1.add(s2.charAt(i));
		}
		System.out.println(set1.size());
	}
		
}	
